fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/suites/test_impl_stm32_can.c
/**
 * @file test_impl_stm32_can.c
 * @author Gao Xing
 * @date 2026/8/24
 * @version 1.0
 */

#include "impl_stm32_can.h"
#include "stm32h7_test_support.h"

void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t its);
void HAL_FDCAN_RxFifo1Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t its);
void HAL_FDCAN_ErrorStatusCallback(FDCAN_HandleTypeDef* hfdcan, uint32_t its);
void HAL_FDCAN_ErrorCallback(FDCAN_HandleTypeDef* hfdcan);

static STM32H7_Test_Storage_u storage_a;
static STM32H7_Test_Storage_u storage_b;
static FDCAN_HandleTypeDef    hfdcan;
static void*                  expected_arg;
static uint32_t               rx_id;
static uint8_t                rx_len;
static uint8_t                rx_first;
static uint32_t               rx_count;
static uint32_t               err_bits;
static uint32_t               err_count;

static void rx_cb(void* arg, uint32_t id, const uint8_t* data, uint8_t len)
{
    TEST_ASSERT_EQUAL_PTR(expected_arg, arg);
    TEST_ASSERT_NOT_NULL(data);
    rx_id    = id;
    rx_len   = len;
    rx_first = data[0];
    rx_count++;
}

static void err_cb(void* arg, uint32_t err)
{
    TEST_ASSERT_EQUAL_PTR(expected_arg, arg);
    err_bits |= err;
    err_count++;
}

/* Captures what was actually programmed into the filter list. The range tests assert
 * on this rather than on ConfigFilter merely having been called: the difference between
 * RANGE and a mask is invisible in the call count, and a mask covering 0x201..0x204
 * would silently admit 0x200..0x207. */
static FDCAN_FilterTypeDef last_filter;
static unsigned            filter_writes;

static HAL_StatusTypeDef capture_filter(FDCAN_HandleTypeDef* h, FDCAN_FilterTypeDef* f, int calls)
{
    (void) h;
    (void) calls;
    last_filter = *f;
    filter_writes++;
    return HAL_OK;
}

void setUp(void)
{
    STM32H7_Test_MockInit();
    memset(&hfdcan, 0, sizeof(hfdcan));
    hfdcan.Init.RxFifo0ElmtsNbr = 8u;
    hfdcan.Init.StdFiltersNbr   = 8u;
    expected_arg                = &hfdcan;
    rx_id                       = 0u;
    rx_len                      = 0u;
    rx_first                    = 0u;
    rx_count                    = 0u;
    err_bits                    = 0u;
    err_count                   = 0u;
    filter_writes               = 0u;
    memset(&last_filter, 0, sizeof(last_filter));
}

void tearDown(void) { STM32H7_Test_MockVerify(); }

static void* create_node(STM32H7_Test_Storage_u* storage, uint32_t tx_id, uint32_t rx_id_value)
{
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage->bytes);
    return IMPL_STM32_CAN_CreateCtx(&hfdcan, tx_id, rx_id_value);
}

static void expect_start_success(FDCAN_HandleTypeDef* handle)
{
    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(handle, FDCAN_REJECT, FDCAN_REJECT,
                                                 FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_OK);
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(handle, HAL_OK);
    HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(HAL_OK);
}

static void test_create_guards_allocator_duplicate_and_capacity(void)
{
    TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_GetOps());
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(NULL, 1u, 2u));
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 0x800u, 2u));
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 1u, 0x800u));

    FDCAN_HandleTypeDef no_fifo = {0};
    no_fifo.Init.StdFiltersNbr  = 1u;
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&no_fifo, 1u, 2u));
    FDCAN_HandleTypeDef no_filter  = {0};
    no_filter.Init.RxFifo1ElmtsNbr = 1u;
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&no_filter, 1u, 2u));

    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), NULL);
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 1u, 2u));

    STM32H7_Test_Storage_u contexts[17];
    for (uint32_t i = 0u; i < 16u; i++)
    {
        IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), contexts[i].bytes);
        TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 0x100u + i, 0x200u + i));
    }
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 0x300u, 0x200u));

    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), contexts[16].bytes);
    IMPL_free_Expect(contexts[16].bytes);
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 0x300u, 0x300u));
}

static void test_start_rolls_back_failures_retries_and_adds_live_filter(void)
{
    void*            first = create_node(&storage_a, 0x201u, 0x202u);
    const CAN_Ops_s* ops   = IMPL_STM32_CAN_GetOps();
    TEST_ASSERT_NOT_NULL(first);

    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(
        &hfdcan, FDCAN_REJECT, FDCAN_REJECT, FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_ERROR);
    TEST_ASSERT_FALSE(ops->start(first));

    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(&hfdcan, FDCAN_REJECT, FDCAN_REJECT,
                                                 FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_OK);
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_ERROR);
    TEST_ASSERT_FALSE(ops->start(first));

    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(&hfdcan, FDCAN_REJECT, FDCAN_REJECT,
                                                 FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_OK);
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_ERROR);
    TEST_ASSERT_FALSE(ops->start(first));

    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(&hfdcan, FDCAN_REJECT, FDCAN_REJECT,
                                                 FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(HAL_ERROR);
    HAL_FDCAN_Stop_ExpectAndReturn(&hfdcan, HAL_OK);
    TEST_ASSERT_FALSE(ops->start(first));

    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(&hfdcan, FDCAN_REJECT, FDCAN_REJECT,
                                                 FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(first));

    void* second = create_node(&storage_b, 0x203u, 0x204u);
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(second));
    TEST_ASSERT_TRUE(ops->start(second));
}

