fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/suites/test_impl_stm32_can.c
static HAL_StatusTypeDef tx_check(FDCAN_HandleTypeDef* handle, FDCAN_TxHeaderTypeDef* header,
                                  uint8_t* data, int call_count)
{
    TEST_ASSERT_EQUAL_PTR(&hfdcan, handle);
    TEST_ASSERT_EQUAL_UINT32(FDCAN_STANDARD_ID, header->IdType);
    TEST_ASSERT_EQUAL_UINT32(FDCAN_DATA_FRAME, header->TxFrameType);
    TEST_ASSERT_EQUAL_UINT32(FDCAN_CLASSIC_CAN, header->FDFormat);
    TEST_ASSERT_EQUAL_UINT32(FDCAN_BRS_OFF, header->BitRateSwitch);
    if (call_count == 0)
    {
        TEST_ASSERT_EQUAL_HEX32(0x201u, header->Identifier);
        TEST_ASSERT_EQUAL_UINT32(3u, header->DataLength);
        TEST_ASSERT_EQUAL_HEX8(1u, data[0]);
        TEST_ASSERT_EQUAL_HEX8(3u, data[2]);
        TEST_ASSERT_EQUAL_HEX8(0u, data[7]);
        return HAL_OK;
    }
    TEST_ASSERT_EQUAL_HEX32(0x345u, header->Identifier);
    TEST_ASSERT_EQUAL_UINT32(IMPL_CAN_MAX_DLC, header->DataLength);
    return HAL_ERROR;
}

static void test_send_requires_started_bus_and_builds_classic_frame(void)
{
    void*            ctx      = create_node(&storage_a, 0x201u, 0x202u);
    const CAN_Ops_s* ops      = IMPL_STM32_CAN_GetOps();
    uint8_t          data[12] = {1u, 2u, 3u, 4u, 5u, 6u, 7u, 8u, 9u};

    TEST_ASSERT_FALSE(ops->send(ctx, data, 3u));
    expect_start_success(&hfdcan);
    TEST_ASSERT_TRUE(ops->start(ctx));

    HAL_FDCAN_AddMessageToTxFifoQ_StubWithCallback(tx_check);
    TEST_ASSERT_TRUE(ops->send(ctx, data, 3u));
    TEST_ASSERT_FALSE(ops->send(ctx, NULL, 1u));
    TEST_ASSERT_FALSE(ops->send_to(ctx, 0x800u, data, 1u));
    TEST_ASSERT_FALSE(ops->send_to(ctx, 0x345u, data, sizeof(data)));
    HAL_FDCAN_GetTxFifoFreeLevel_ExpectAndReturn(&hfdcan, 5u);
    TEST_ASSERT_EQUAL_UINT32(5u, ops->tx_free(ctx));
}

static void test_receive_routes_fifo0_fifo1_lost_and_malformed_frames(void)
{
    void*            first = create_node(&storage_a, 0x301u, 0x302u);
    const CAN_Ops_s* ops   = IMPL_STM32_CAN_GetOps();
    ops->attach_cb(first, rx_cb, err_cb, &hfdcan);

    FDCAN_RxHeaderTypeDef header = {
        .Identifier  = 0x302u,
        .IdType      = FDCAN_STANDARD_ID,
        .RxFrameType = FDCAN_DATA_FRAME,
        .DataLength  = 2u,
    };
    uint8_t payload[64] = {0xA5u, 0x5Au};
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    FDCAN_RxHeaderTypeDef malformed = header;
    malformed.IdType                = 99u;
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&malformed);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
    HAL_FDCAN_RxFifo0Callback(&hfdcan,
                              FDCAN_IT_RX_FIFO0_NEW_MESSAGE | FDCAN_IT_RX_FIFO0_MESSAGE_LOST);
    TEST_ASSERT_EQUAL_UINT32(1u, rx_count);
    TEST_ASSERT_EQUAL_HEX32(0x302u, rx_id);
    TEST_ASSERT_EQUAL_UINT8(2u, rx_len);
    TEST_ASSERT_EQUAL_HEX8(0xA5u, rx_first);
    TEST_ASSERT_EQUAL_HEX32(IMPL_CAN_ERR_OVERRUN, err_bits);

    FDCAN_HandleTypeDef fifo1  = {0};
    fifo1.Init.RxFifo1ElmtsNbr = 4u;
    fifo1.Init.StdFiltersNbr   = 1u;
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_b.bytes);
    void* second = IMPL_STM32_CAN_CreateCtx(&fifo1, 0x401u, 0x402u);
    expected_arg = &fifo1;
    ops->attach_cb(second, rx_cb, err_cb, &fifo1);
    header.Identifier  = 0x402u;
    header.IdType      = FDCAN_STANDARD_ID;
    header.RxFrameType = FDCAN_DATA_FRAME;
    header.DataLength  = 15u;
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&fifo1, FDCAN_RX_FIFO1, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&fifo1, FDCAN_RX_FIFO1, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_ERROR);
    HAL_FDCAN_RxFifo1Callback(&fifo1, FDCAN_IT_RX_FIFO1_NEW_MESSAGE);
    TEST_ASSERT_EQUAL_UINT32(2u, rx_count);
    TEST_ASSERT_EQUAL_UINT8(IMPL_CAN_MAX_DLC, rx_len);

    FDCAN_HandleTypeDef unknown = {0};
    HAL_FDCAN_RxFifo0Callback(&unknown, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);
}

static void expect_status(FDCAN_ProtocolStatusTypeDef* status)
{
    HAL_FDCAN_GetProtocolStatus_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetProtocolStatus_ReturnThruPtr_status(status);
}

/**
 * @brief A destroyed node must stop receiving, and its slot must be reusable.
 *
 * CreateCtx publishes the context against its receive identifier, and the receive
 * path dereferences whatever that lookup returns — c->rx_cb, then c->arg — from
 * interrupt context. DestroyCtx used to free the context and leave the routing entry
 * behind, so the next admitted frame on that identifier called through a dangling
 * pointer inside an ISR. Nothing had failed only because no caller destroys a node.
 *
 * The frame after the destroy is still admitted by the hardware filter, which
 * DestroyCtx deliberately leaves in place: the routing lookup returns NULL and the
 * receive loop discards it as "an id nobody claimed". That is the observable contract
 * — no callback, no crash.
 */
static void test_destroy_stops_routing_and_frees_the_identifier(void)
{
    void*            node = create_node(&storage_a, 0x501u, 0x502u);
    const CAN_Ops_s* ops  = IMPL_STM32_CAN_GetOps();
    ops->attach_cb(node, rx_cb, err_cb, &hfdcan);

    IMPL_free_Expect(storage_a.bytes);
    IMPL_STM32_CAN_DestroyCtx(node);

    /* A frame on the retired identifier: admitted by the filter, routed nowhere. */
    FDCAN_RxHeaderTypeDef header = {
        .Identifier  = 0x502u,
        .IdType      = FDCAN_STANDARD_ID,
        .RxFrameType = FDCAN_DATA_FRAME,
        .DataLength  = 1u,
    };
    uint8_t payload[64] = {0x7Eu};
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
    HAL_FDCAN_RxFifo0Callback(&hfdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);

    TEST_ASSERT_EQUAL_UINT32(0u, rx_count);

    /* The identifier is free again: creating on it must succeed, where before the fix
     * the surviving route entry made CreateCtx report it as already claimed. */
    void* again = create_node(&storage_b, 0x501u, 0x502u);
    TEST_ASSERT_NOT_NULL(again);
}

/**
 * @brief A range claim installs one RANGE element and routes every id inside it.
 *
 * This is the whole point of the range API: a four-wheel DJI chassis claims
 * 0x201..0x204 with one node, one filter element and one routing entry, where four
 * single-identifier nodes would spend four of each.
 *
 * The filter must be FDCAN_FILTER_RANGE and not a mask. A mask matches a power-of-two
 * block, so the narrowest mask covering 0x201..0x204 also admits 0x200..0x207 —
 * swallowing the DJI control identifier and three GM6020 feedback identifiers that may
 * belong to another node.
 */
static void test_range_claim_installs_one_element_and_routes_the_span(void)
{
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_a.bytes);
    void* node = IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x201u, 0x204u);
    TEST_ASSERT_NOT_NULL(node);

    const CAN_Ops_s* ops = IMPL_STM32_CAN_GetOps();
    ops->attach_cb(node, rx_cb, err_cb, &hfdcan);

    HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(&hfdcan, FDCAN_REJECT, FDCAN_REJECT,
                                                 FDCAN_REJECT_REMOTE, FDCAN_REJECT_REMOTE, HAL_OK);
    HAL_FDCAN_ConfigFilter_StubWithCallback(capture_filter);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(node));

    /* ONE element, in RANGE mode, spanning exactly the claim. A mask here would admit
     * 0x200..0x207; DUAL would admit only the two endpoints. */
    TEST_ASSERT_EQUAL_UINT(1u, filter_writes);
    TEST_ASSERT_EQUAL_UINT32(FDCAN_FILTER_RANGE, last_filter.FilterType);
    TEST_ASSERT_EQUAL_HEX32(0x201u, last_filter.FilterID1);
    TEST_ASSERT_EQUAL_HEX32(0x204u, last_filter.FilterID2);

    /* Every identifier in the span must reach this one node — including the interior
     * ones, which no registry entry names. */
    const uint32_t inside[] = {0x201u, 0x202u, 0x203u, 0x204u};

    for (unsigned i = 0u; i < (sizeof inside / sizeof inside[0]); i++)
    {
        FDCAN_RxHeaderTypeDef header = {
            .Identifier  = inside[i],
            .IdType      = FDCAN_STANDARD_ID,
            .RxFrameType = FDCAN_DATA_FRAME,
            .DataLength  = 1u,
        };
        uint8_t payload[64] = {(uint8_t) i};

        HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
        HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
        HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
        HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
        HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
        HAL_FDCAN_RxFifo0Callback(&hfdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);

