fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/suites/test_impl_stm32_can.c
        TEST_ASSERT_EQUAL_UINT32(i + 1u, rx_count);
        TEST_ASSERT_EQUAL_HEX32(inside[i], rx_id);
    }

    /* One past each end must not route — the guarantee a mask filter could not make. */
    FDCAN_RxHeaderTypeDef outside = {
        .Identifier  = 0x205u,
        .IdType      = FDCAN_STANDARD_ID,
        .RxFrameType = FDCAN_DATA_FRAME,
        .DataLength  = 1u,
    };
    uint8_t payload[64] = {0xFFu};
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&outside);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
    HAL_FDCAN_RxFifo0Callback(&hfdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);

    TEST_ASSERT_EQUAL_UINT32(4u, rx_count); /* unchanged */
}

/**
 * @brief A range that overlaps an existing claim is refused, in both directions.
 */
static void test_overlapping_claims_are_refused(void)
{
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_a.bytes);
    TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x201u, 0x204u));

    /* A single identifier inside the span, and a span overlapping it at either end:
     * all three would silently steal traffic, since only one owner can win a lookup. */
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&hfdcan, 0x200u, 0x203u));
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x204u, 0x208u));
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x1FFu, 0x201u));

    /* Adjacent but disjoint is fine. */
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_b.bytes);
    TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x205u, 0x208u));
}

/**
 * @brief A range claim taken before a single identifier still admits the single one.
 *
 * A single identifier that falls inside an already-claimed span is refused, so the
 * interesting case is the reverse order: a single outside the span must still get its
 * own element rather than being swallowed by the range's idempotence check.
 */
static void test_single_identifier_outside_a_range_still_gets_a_filter(void)
{
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_a.bytes);
    void* ranged = IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x201u, 0x204u);
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_b.bytes);
    void* single = IMPL_STM32_CAN_CreateCtx(&hfdcan, 0x200u, 0x300u);

    TEST_ASSERT_NOT_NULL(ranged);
    TEST_ASSERT_NOT_NULL(single);

    const CAN_Ops_s* ops = IMPL_STM32_CAN_GetOps();

    HAL_FDCAN_ConfigGlobalFilter_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(ranged));

    /* A second, separate element — the range element is full by construction. */
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(single));

    ops->attach_cb(single, rx_cb, err_cb, &hfdcan);

    FDCAN_RxHeaderTypeDef header = {
        .Identifier  = 0x300u,
        .IdType      = FDCAN_STANDARD_ID,
        .RxFrameType = FDCAN_DATA_FRAME,
        .DataLength  = 1u,
    };
    uint8_t payload[64] = {0x11u};
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
    HAL_FDCAN_RxFifo0Callback(&hfdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);

    TEST_ASSERT_EQUAL_UINT32(1u, rx_count);
    TEST_ASSERT_EQUAL_HEX32(0x300u, rx_id);
}

/**
 * @brief An inverted range is refused rather than claiming nothing silently.
 */
static void test_inverted_range_is_refused(void)
{
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x204u, 0x201u));
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x201u, 0x800u));
}

/**
 * @brief Destroying a range node stops routing the whole span and frees it for reuse.
 *
 * The range table is the second place a context is published, so a destroy that
 * retired only the registry entry would leave route_find handing an interrupt a freed
 * pointer for every identifier in the span but the first.
 */
static void test_destroying_a_range_node_stops_the_whole_span(void)
{
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_a.bytes);
    void*            node = IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x201u, 0x204u);
    const CAN_Ops_s* ops  = IMPL_STM32_CAN_GetOps();
    ops->attach_cb(node, rx_cb, err_cb, &hfdcan);

    /* Started, because the receive path returns early on a bus that was never started
     * — without this the case would pass no matter what teardown did. */
    HAL_FDCAN_ConfigGlobalFilter_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(node));

    IMPL_free_Expect(storage_a.bytes);
    IMPL_STM32_CAN_DestroyCtx(node);

    /* An interior identifier — reachable only through the range table, so this is the
     * one a registry-only Remove would have missed. */
    FDCAN_RxHeaderTypeDef header = {
        .Identifier  = 0x203u,
        .IdType      = FDCAN_STANDARD_ID,
        .RxFrameType = FDCAN_DATA_FRAME,
        .DataLength  = 1u,
    };
    uint8_t payload[64] = {0x22u};
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
    HAL_FDCAN_RxFifo0Callback(&hfdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);

    TEST_ASSERT_EQUAL_UINT32(0u, rx_count);

    /* The span is free again, and the retired slot is reused rather than grown. */
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), storage_b.bytes);
    TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_CreateCtxRange(&hfdcan, 0x200u, 0x201u, 0x204u));
}

