fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/suites/test_impl_stm32_can.c
static void test_status_and_protocol_errors_map_broadcast_and_recover(void)
{
    void*            first  = create_node(&storage_a, 0x501u, 0x502u);
    void*            second = create_node(&storage_b, 0x503u, 0x504u);
    const CAN_Ops_s* ops    = IMPL_STM32_CAN_GetOps();
    ops->attach_cb(first, rx_cb, err_cb, &hfdcan);
    ops->attach_cb(second, rx_cb, err_cb, &hfdcan);

    FDCAN_HandleTypeDef unknown = {0};
    HAL_FDCAN_ErrorStatusCallback(&unknown, FDCAN_IT_BUS_OFF);
    HAL_FDCAN_ErrorCallback(&unknown);

    FDCAN_ProtocolStatusTypeDef status = {
        .Warning      = 1u,
        .ErrorPassive = 1u,
        .BusOff       = 1u,
    };
    expect_status(&status);
    HAL_FDCAN_Stop_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_ERROR);
    HAL_FDCAN_ErrorStatusCallback(&hfdcan, FDCAN_IT_ERROR_WARNING | FDCAN_IT_ERROR_PASSIVE |
                                               FDCAN_IT_BUS_OFF);
    TEST_ASSERT_EQUAL_HEX32(IMPL_CAN_ERR_WARNING | IMPL_CAN_ERR_PASSIVE | IMPL_CAN_ERR_BUS_OFF,
                            err_bits);
    TEST_ASSERT_EQUAL_UINT32(2u, err_count);

    expect_start_success(&hfdcan);
    TEST_ASSERT_TRUE(ops->start(first));

    status.Warning      = 0u;
    status.ErrorPassive = 0u;
    status.BusOff       = 1u;
    expect_status(&status);
    HAL_FDCAN_Stop_ExpectAndReturn(&hfdcan, HAL_ERROR);
    HAL_FDCAN_ErrorStatusCallback(&hfdcan, FDCAN_IT_BUS_OFF);
    expect_status(&status);
    HAL_FDCAN_Stop_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_Start_ExpectAndReturn(&hfdcan, HAL_OK);
    HAL_FDCAN_ErrorStatusCallback(&hfdcan, FDCAN_IT_BUS_OFF);

    const uint32_t protocol_codes[] = {
        FDCAN_PROTOCOL_ERROR_STUFF, FDCAN_PROTOCOL_ERROR_FORM, FDCAN_PROTOCOL_ERROR_ACK,
        FDCAN_PROTOCOL_ERROR_BIT1,  FDCAN_PROTOCOL_ERROR_BIT0, FDCAN_PROTOCOL_ERROR_CRC,
        FDCAN_PROTOCOL_ERROR_NONE,
    };
    for (uint32_t i = 0u; i < sizeof(protocol_codes) / sizeof(protocol_codes[0]); i++)
    {
        status.LastErrorCode = protocol_codes[i];
        hfdcan.ErrorCode     = HAL_FDCAN_ERROR_PROTOCOL_ARBT;
        expect_status(&status);
        HAL_FDCAN_ErrorCallback(&hfdcan);
        TEST_ASSERT_EQUAL_HEX32(HAL_FDCAN_ERROR_NONE, hfdcan.ErrorCode);
    }

    hfdcan.ErrorCode = HAL_FDCAN_ERROR_RAM_ACCESS;
    HAL_FDCAN_ErrorCallback(&hfdcan);
    TEST_ASSERT_EQUAL_HEX32(IMPL_CAN_ERR_WARNING | IMPL_CAN_ERR_PASSIVE | IMPL_CAN_ERR_BUS_OFF |
                                IMPL_CAN_ERR_STUFF | IMPL_CAN_ERR_FORM | IMPL_CAN_ERR_ACK |
                                IMPL_CAN_ERR_BIT | IMPL_CAN_ERR_CRC | IMPL_CAN_ERR_OVERRUN,
                            err_bits);
}

static void test_bus_and_filter_capacity_follow_hardware_limits(void)
{
    FDCAN_HandleTypeDef    handles[4] = {0};
    STM32H7_Test_Storage_u contexts[5];
    const CAN_Ops_s*       ops = IMPL_STM32_CAN_GetOps();

    handles[0].Init.RxFifo0ElmtsNbr = 1u;
    handles[0].Init.StdFiltersNbr   = 1u;
    for (uint32_t i = 0u; i < 3u; i++)
    {
        IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), contexts[i].bytes);
    }
    void* first  = IMPL_STM32_CAN_CreateCtx(&handles[0], 0x100u, 0x200u);
    void* second = IMPL_STM32_CAN_CreateCtx(&handles[0], 0x101u, 0x201u);
    void* third  = IMPL_STM32_CAN_CreateCtx(&handles[0], 0x102u, 0x202u);
    TEST_ASSERT_NOT_NULL(first);
    TEST_ASSERT_NOT_NULL(second);
    TEST_ASSERT_NOT_NULL(third);

    expect_start_success(&handles[0]);
    TEST_ASSERT_TRUE(ops->start(first));
    HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(HAL_OK);
    TEST_ASSERT_TRUE(ops->start(second));
    TEST_ASSERT_FALSE(ops->start(third));

    handles[1].Init.RxFifo0ElmtsNbr = 1u;
    handles[1].Init.StdFiltersNbr   = 20u;
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), contexts[3].bytes);
    TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_CreateCtx(&handles[1], 0x103u, 0x203u));

    handles[2].Init.RxFifo0ElmtsNbr = 1u;
    handles[2].Init.StdFiltersNbr   = 1u;
    IMPL_malloc_ExpectAndReturn(sizeof(IMPL_STM32_CAN_Context_s), contexts[4].bytes);
    TEST_ASSERT_NOT_NULL(IMPL_STM32_CAN_CreateCtx(&handles[2], 0x104u, 0x204u));

    handles[3].Init.RxFifo0ElmtsNbr = 1u;
    handles[3].Init.StdFiltersNbr   = 1u;
    TEST_ASSERT_NULL(IMPL_STM32_CAN_CreateCtx(&handles[3], 0x105u, 0x205u));
}

static void test_null_callbacks_ignore_frames_and_recovered_status(void)
{
    TEST_ASSERT_NOT_NULL(create_node(&storage_a, 0x601u, 0x602u));

    FDCAN_RxHeaderTypeDef header = {
        .Identifier  = 0x602u,
        .IdType      = FDCAN_STANDARD_ID,
        .RxFrameType = FDCAN_DATA_FRAME,
        .DataLength  = 1u,
    };
    uint8_t payload[64] = {0xA5u};
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    header.Identifier = 0x603u;
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 1u);
    HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(HAL_OK);
    HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(&header);
    HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(payload, 64u);
    HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(&hfdcan, FDCAN_RX_FIFO0, 0u);
    HAL_FDCAN_RxFifo0Callback(&hfdcan, FDCAN_IT_RX_FIFO0_NEW_MESSAGE);

    FDCAN_ProtocolStatusTypeDef recovered = {0};
    expect_status(&recovered);
    HAL_FDCAN_ErrorStatusCallback(&hfdcan, FDCAN_IT_ERROR_WARNING | FDCAN_IT_ERROR_PASSIVE |
                                               FDCAN_IT_BUS_OFF);

    hfdcan.ErrorCode = HAL_FDCAN_ERROR_PROTOCOL_DATA;
    HAL_FDCAN_GetProtocolStatus_ExpectAnyArgsAndReturn(HAL_ERROR);
    HAL_FDCAN_ErrorCallback(&hfdcan);
    TEST_ASSERT_EQUAL_HEX32(HAL_FDCAN_ERROR_NONE, hfdcan.ErrorCode);

    hfdcan.ErrorCode = HAL_FDCAN_ERROR_RAM_ACCESS;
    HAL_FDCAN_ErrorCallback(&hfdcan);
}

STM32H7_TEST_MAIN_BEGIN()
STM32H7_RUN_TEST(test_create_guards_allocator_duplicate_and_capacity);
STM32H7_RUN_TEST(test_start_rolls_back_failures_retries_and_adds_live_filter);
STM32H7_RUN_TEST(test_send_requires_started_bus_and_builds_classic_frame);
STM32H7_RUN_TEST(test_receive_routes_fifo0_fifo1_lost_and_malformed_frames);
STM32H7_RUN_TEST(test_destroy_stops_routing_and_frees_the_identifier);
STM32H7_RUN_TEST(test_range_claim_installs_one_element_and_routes_the_span);
STM32H7_RUN_TEST(test_overlapping_claims_are_refused);
STM32H7_RUN_TEST(test_single_identifier_outside_a_range_still_gets_a_filter);
STM32H7_RUN_TEST(test_inverted_range_is_refused);
STM32H7_RUN_TEST(test_destroying_a_range_node_stops_the_whole_span);
STM32H7_RUN_TEST(test_status_and_protocol_errors_map_broadcast_and_recover);
STM32H7_RUN_TEST(test_bus_and_filter_capacity_follow_hardware_limits);
STM32H7_RUN_TEST(test_null_callbacks_ignore_frames_and_recovered_status);
STM32H7_TEST_MAIN_END()